wmstianya/lighting/Core/Src/stm32f1xx_it_old.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    stm32f1xx_it.c
  * @brief   Interrupt Service Routines.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_it.h"
#include "modbus_rtu_slave.h"

// 声明全局 Modbus 实例在main.c中定义
extern ModbusRTU_Slave g_mb;

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN TD */

/* USER CODE END TD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/* External variables --------------------------------------------------------*/
extern DMA_HandleTypeDef hdma_usart1_rx;
extern DMA_HandleTypeDef hdma_usart1_tx;
extern UART_HandleTypeDef huart1;
extern TIM_HandleTypeDef htim2;
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/******************************************************************************/
/*           Cortex-M3 Processor Interruption and Exception Handlers          */
/******************************************************************************/
/**
  * @brief This function handles Non maskable interrupt.
  */
void NMI_Handler(void)
{
  /* USER CODE BEGIN NonMaskableInt_IRQn 0 */

  /* USER CODE END NonMaskableInt_IRQn 0 */
  /* USER CODE BEGIN NonMaskableInt_IRQn 1 */
   while (1)
  {
  }
  /* USER CODE END NonMaskableInt_IRQn 1 */
}

/**
  * @brief This function handles Hard fault interrupt.
  */
void HardFault_Handler(void)
{
  /* USER CODE BEGIN HardFault_IRQn 0 */

  /* USER CODE END HardFault_IRQn 0 */
  while (1)
  {
    /* USER CODE BEGIN W1_HardFault_IRQn 0 */
    /* USER CODE END W1_HardFault_IRQn 0 */
  }
}

/**
  * @brief This function handles Memory management fault.
  */
void MemManage_Handler(void)
{
  /* USER CODE BEGIN MemoryManagement_IRQn 0 */

  /* USER CODE END MemoryManagement_IRQn 0 */
  while (1)
  {
    /* USER CODE BEGIN W1_MemoryManagement_IRQn 0 */
    /* USER CODE END W1_MemoryManagement_IRQn 0 */
  }
}

/**
  * @brief This function handles Prefetch fault, memory access fault.
  */
void BusFault_Handler(void)
{
  /* USER CODE BEGIN BusFault_IRQn 0 */

  /* USER CODE END BusFault_IRQn 0 */
  while (1)
  {
    /* USER CODE BEGIN W1_BusFault_IRQn 0 */
    /* USER CODE END W1_BusFault_IRQn 0 */
  }
}

/**
  * @brief This function handles Undefined instruction or illegal state.
  */
void UsageFault_Handler(void)
{
  /* USER CODE BEGIN UsageFault_IRQn 0 */

  /* USER CODE END UsageFault_IRQn 0 */
  while (1)
  {
    /* USER CODE BEGIN W1_UsageFault_IRQn 0 */
    /* USER CODE END W1_UsageFault_IRQn 0 */
  }
}

/**
  * @brief This function handles System service call via SWI instruction.
  */
void SVC_Handler(void)
{
  /* USER CODE BEGIN SVCall_IRQn 0 */

  /* USER CODE END SVCall_IRQn 0 */
  /* USER CODE BEGIN SVCall_IRQn 1 */

  /* USER CODE END SVCall_IRQn 1 */
}

/**
  * @brief This function handles Debug monitor.
  */
void DebugMon_Handler(void)
{
  /* USER CODE BEGIN DebugMonitor_IRQn 0 */

  /* USER CODE END DebugMonitor_IRQn 0 */
  /* USER CODE BEGIN DebugMonitor_IRQn 1 */

  /* USER CODE END DebugMonitor_IRQn 1 */
}

/**
  * @brief This function handles Pendable request for system service.
  */
void PendSV_Handler(void)
{
  /* USER CODE BEGIN PendSV_IRQn 0 */

  /* USER CODE END PendSV_IRQn 0 */
  /* USER CODE BEGIN PendSV_IRQn 1 */

  /* USER CODE END PendSV_IRQn 1 */
}

/**
  * @brief This function handles System tick timer.
  */
void SysTick_Handler(void)
{
  /* USER CODE BEGIN SysTick_IRQn 0 */

  /* USER CODE END SysTick_IRQn 0 */
  HAL_IncTick();
  /* USER CODE BEGIN SysTick_IRQn 1 */

  /* USER CODE END SysTick_IRQn 1 */
}

/******************************************************************************/
/* STM32F1xx Peripheral Interrupt Handlers                                    */
/* Add here the Interrupt Handlers for the used peripherals.                  */
/* For the available peripheral interrupt handler names,                      */
/* please refer to the startup file (startup_stm32f1xx.s).                    */
/******************************************************************************/

/**
  * @brief This function handles DMA1 channel4 global interrupt.
  */
void DMA1_Channel4_IRQHandler(void)
{
  /* USER CODE BEGIN DMA1_Channel4_IRQn 0 */

  /* USER CODE END DMA1_Channel4_IRQn 0 */
  HAL_DMA_IRQHandler(&hdma_usart1_tx);
  /* USER CODE BEGIN DMA1_Channel4_IRQn 1 */

  /* USER CODE END DMA1_Channel4_IRQn 1 */
}

/**
  * @brief This function handles DMA1 channel5 global interrupt.
  */
void DMA1_Channel5_IRQHandler(void)
{
  /* USER CODE BEGIN DMA1_Channel5_IRQn 0 */

  /* USER CODE END DMA1_Channel5_IRQn 0 */
  HAL_DMA_IRQHandler(&hdma_usart1_rx);
  /* USER CODE BEGIN DMA1_Channel5_IRQn 1 */

  /* USER CODE END DMA1_Channel5_IRQn 1 */
}


/**
  * @brief This function handles USART1 global interrupt.
  */
void USART1_IRQHandler(void)
{
  // ����Ƿ���IDLE Line�жϱ�־λ
  if (__HAL_UART_GET_FLAG(&huart1, UART_FLAG_IDLE)!= RESET)
  {
    // �ؼ����裺���������IDLE��־λ������᲻�Ͻ����ж�
    __HAL_UART_CLEAR_IDLEFLAG(&huart1);

    // 1. ֹͣDMA���գ���ȷ��DMA������ֵ�ȶ����Ӷ�����׼ȷ���㳤��
    Modbus_HAL_StopReception(&g_modbus_instance1);

    // 2. ���㱾��ʵ�ʽ��յ����ֽ���
    // DMA_CNDTRx �Ĵ����洢����ʣ��δ��������ݸ���
    g_modbus_instance1.u16RxLen = MODBUS_BUFFER_SIZE - __HAL_DMA_GET_COUNTER(g_modbus_instance1.hdma_rx);

    // 3. ��λ������־ (�л�״̬��)��֪ͨ��ѭ������֡����
    if (g_modbus_instance1.u16RxLen > 0)
    {
        g_modbus_instance1.eState = STATE_FRAME_RECEIVED;
    }

    // 4. ��������DMA���գ�Ϊ��һ֡������׼��
    Modbus_HAL_StartReception(&g_modbus_instance1);
  }

  // ����HAL��Ĭ�ϵ�IRQHandler���������жϣ�������жϣ�
  HAL_UART_IRQHandler(&huart1);
}

/**
  * @brief This function handles USART2 global interrupt.
  */
void USART2_IRQHandler(void)
{
  // ��USART1_IRQHandler�߼���ȫ��ͬ��ֻ�ǲ���g_modbus_instance2
  if (__HAL_UART_GET_FLAG(&huart2, UART_FLAG_IDLE)!= RESET)
  {
    __HAL_UART_CLEAR_IDLEFLAG(&huart2);
    Modbus_HAL_StopReception(&g_modbus_instance2);
    g_modbus_instance2.u16RxLen = MODBUS_BUFFER_SIZE - __HAL_DMA_GET_COUNTER(g_modbus_instance2.hdma_rx);
    if (g_modbus_instance2.u16RxLen > 0)
    {
        g_modbus_instance2.eState = STATE_FRAME_RECEIVED;
    }
    Modbus_HAL_StartReception(&g_modbus_instance2);
  }
  HAL_UART_IRQHandler(&huart2);
}


/**
  * @brief  Tx Transfer completed callback.
  * @param  huart UART handle.
  * @retval None
  */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    ModbusInstance_t* pInstance = NULL;

    // ����huart����ҵ���Ӧ��Modbusʵ��
    if (huart->Instance == USART1)
    {
        pInstance = &g_modbus_instance1;
    }
    else if (huart->Instance == USART2)
    {
        pInstance = &g_modbus_instance2;
    }

    if (pInstance!= NULL)
    {
        // 1. 发送完成，将RS485收发器切换回接收模式，释放总线
        Modbus_HAL_SetDirRx(pInstance);
        
        // 2. 添加小延时确保RS485方向切换稳定
        for(volatile int i = 0; i < 20; i++); // 约2微秒延时

        // 3. 重新启动DMA接收，准备下一个命令
        Modbus_HAL_StartReception(pInstance);

        // 4. 将协议栈状态切换回空闲状态
        pInstance->eState = STATE_IDLE;
    }
}

/* USER CODE BEGIN 1 */

/* USER CODE END 1 */
